export default function translitterify(str = '') {
  let charMap = {
    a: "[àáâãäåăą]",
    A: "[ÀÁÂÃÄÅĂĄ]",
    c: "[ćčç]",
    C: "[ĆČÇ]",
    d: "[ďđ]",
    D: "[ĎĐ]",
    e: "[èéêëëěę]",
    E: "[ÈÉÊËĚĘ]",
    g: "[ğ]",
    G: "[Ğ]",
    i: "[ìíîï]|i̇",
    I: "[İÌÍÎÏ]",
    l: "[ĺľł]",
    L: "[ĹĽŁ]",
    n: "[ñňń]",
    N: "[ÑŇŃ]",
    o: "[òóôõöøő]",
    O: "[ÒÓÔÕÖØ]",
    r: "[řŕ]",
    R: "[ŘŔ]",
    s: "[šşś]",
    S: "[ŠŞŚ]",
    t: "[ťťţ]",
    T: "[ŤŤŢ]",
    u: "[ùúûüů]",
    U: "[ÙÚÛÜŮ]",
    y: "[ÿý]",
    Y: "[ŸÝ]",
    z: "[žźż]",
    Z: "[ŽŹŻ]"
  };

  for (let c in charMap) {
    str = str.replace(new RegExp(charMap[c], 'g'), c);
  }

  return str;
}
